w7d5/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    if @comment.save
---
INSERT INTO "comments" ("body", "link_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "a comment"], ["link_id", 1], ["user_id", 1], ["created_at", "2017-02-10 02:55:26.598587"], ["updated_at", "2017-02-10 02:55:26.598587"]]

  def destroy
    comment = Comment.find(params[:id])
    link = comment.link
    comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]