w7d5/app/controllers/links_controller.rb

  def create
    @link = Link.new(link_params)
    @link.user_id = current_user.id
    if @link.save
---
INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "teehee"], ["url", "cats.com"], ["user_id", 1], ["created_at", "2017-02-10 02:46:27.846724"], ["updated_at", "2017-02-10 02:46:27.846724"]]
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show
    @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]